## Plan Result (prod-prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 50 to add, 0 to change, 50 to destroy.</code></pre>

* Replace
  * module.appeal-benefit.azurerm_role_assignment.dnszonecontributer
  * module.appeal-immigration.azurerm_role_assignment.dnszonecontributer
  * module.apply-divorce.azurerm_role_assignment.dnszonecontributer
  * module.apply-for-probate.azurerm_role_assignment.dnszonecontributer
  * module.apply-to-court-about-child-arrangements-c100.azurerm_role_assignment.dnszonecontributer
  * module.apps-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.apps-nle-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.c100-application.azurerm_role_assignment.dnszonecontributer
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.cjscp_org_uk.azurerm_role_assignment.dnszonecontributer
  * module.claim-employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.courttribunalfinder.azurerm_role_assignment.dnszonecontributer
  * module.ctsc-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.darts-nle-service.azurerm_role_assignment.dnszonecontributer
  * module.darts-service.azurerm_role_assignment.dnszonecontributer
  * module.ejudiciary_net.azurerm_role_assignment.dnszonecontributer
  * module.end-civil-partnership.azurerm_role_assignment.dnszonecontributer
  * module.erupload-justice.azurerm_role_assignment.dnszonecontributer
  * module.eruploadtest-justice.azurerm_role_assignment.dnszonecontributer
  * module.find-court-tribunal.azurerm_role_assignment.dnszonecontributer
  * module.hearings.azurerm_role_assignment.dnszonecontributer
  * module.hmcts-access.azurerm_role_assignment.dnszonecontributer
  * module.hmcts-webchat.azurerm_role_assignment.dnszonecontributer
  * module.hmcts_net.azurerm_dns_zone.zone
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.internal-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.jcm-judiciary.azurerm_role_assignment.dnszonecontributer
  * module.juror-bureau.azurerm_role_assignment.dnszonecontributer
  * module.mailrelay-platform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.mft-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.moneyclaims.azurerm_role_assignment.dnszonecontributer
  * module.pip-court-tribunal-hearings.azurerm_role_assignment.dnszonecontributer
  * module.platform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.pre-recorded-evidence-justice.azurerm_role_assignment.dnszonecontributer
  * module.probatesearch.azurerm_role_assignment.dnszonecontributer
  * module.prod-hmcts-net.azurerm_role_assignment.dnszonecontributer
  * module.prod-internal.azurerm_role_assignment.dnszonecontributer
  * module.prod-platform.azurerm_role_assignment.dnszonecontributer
  * module.reform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.reply-jury-summons.azurerm_role_assignment.dnszonecontributer
  * module.residential-property-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.respond-divorce.azurerm_role_assignment.dnszonecontributer
  * module.respond-employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.sftp-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.track-benefit-appeal.azurerm_role_assignment.dnszonecontributer
  * module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer
  * module.vh.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appeal-benefit.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/appeal-benefit-decision.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/1b4d4b9d-ce99-4e7a-bd99-3e3276241f8b" -> (known after apply)
      ~ name                             = "1b4d4b9d-ce99-4e7a-bd99-3e3276241f8b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/appeal-benefit-decision.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/appeal-benefit-decision.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.appeal-immigration.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/appeal-immigration-asylum-decision.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/26b895f4-2f05-802e-8c0a-1f95a3315c72" -> (known after apply)
      ~ name                             = "26b895f4-2f05-802e-8c0a-1f95a3315c72" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/appeal-immigration-asylum-decision.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/appeal-immigration-asylum-decision.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.apply-divorce.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-divorce.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/947f2979-a018-2913-dfb8-8506f32b8f15" -> (known after apply)
      ~ name                             = "947f2979-a018-2913-dfb8-8506f32b8f15" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-divorce.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.apply-for-probate.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-for-probate.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/4687b029-2fcb-8a62-fe88-151293319c94" -> (known after apply)
      ~ name                             = "4687b029-2fcb-8a62-fe88-151293319c94" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-for-probate.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-for-probate.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-to-court-about-child-arrangements-c100.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/78203a31-4a33-3e18-d089-651accd5c249" -> (known after apply)
      ~ name                             = "78203a31-4a33-3e18-d089-651accd5c249" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-to-court-about-child-arrangements-c100.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements-c100.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.apps-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apps.hmcts.net/providers/Microsoft.Authorization/roleAssignments/d35f8999-b66a-b1a6-2e6f-034d7167097c" -> (known after apply)
      ~ name                             = "d35f8999-b66a-b1a6-2e6f-034d7167097c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apps.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apps.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.apps-nle-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apps-nle.hmcts.net/providers/Microsoft.Authorization/roleAssignments/d3aafa9b-6b98-0687-53cf-d2d712a0c483" -> (known after apply)
      ~ name                             = "d3aafa9b-6b98-0687-53cf-d2d712a0c483" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apps-nle.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apps-nle.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.c100-application.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-to-court-about-child-arrangements.service.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/cad5b005-ccfc-0320-d473-1a4d8c2e2559" -> (known after apply)
      ~ name                             = "cad5b005-ccfc-0320-d473-1a4d8c2e2559" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/apply-to-court-about-child-arrangements.service.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements.service.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.casetracker.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/casetracker.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/b3d4c7dd-ca3f-a59a-f733-04faeaf7f0dc" -> (known after apply)
      ~ name                             = "b3d4c7dd-ca3f-a59a-f733-04faeaf7f0dc" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/casetracker.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/casetracker.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/certificatedbailiffs.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/129cf748-c379-0a9a-b9a4-a991029cd132" -> (known after apply)
      ~ name                             = "129cf748-c379-0a9a-b9a4-a991029cd132" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/certificatedbailiffs.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/certificatedbailiffs.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cjscp_org_uk.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/cjscp.org.uk/providers/Microsoft.Authorization/roleAssignments/bc639f90-e617-ca02-0577-ab1555838293" -> (known after apply)
      ~ name                             = "bc639f90-e617-ca02-0577-ab1555838293" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/cjscp.org.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/cjscp.org.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.claim-employment-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/claim-employment-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/81bf409f-7ad0-d743-a7e3-b9e41d5c81c6" -> (known after apply)
      ~ name                             = "81bf409f-7ad0-d743-a7e3-b9e41d5c81c6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/claim-employment-tribunals.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/claim-employment-tribunals.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/courtfines.direct.gov.uk/providers/Microsoft.Authorization/roleAssignments/1dcf1124-8137-4857-2275-c278011d6e12" -> (known after apply)
      ~ name                             = "1dcf1124-8137-4857-2275-c278011d6e12" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/courtfines.direct.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/courtfines.direct.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.courttribunalfinder.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/courttribunalfinder.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/23fe7658-1ca2-74e3-b5b6-a4d8e42fd11e" -> (known after apply)
      ~ name                             = "23fe7658-1ca2-74e3-b5b6-a4d8e42fd11e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/courttribunalfinder.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/courttribunalfinder.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ctsc-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/ctsc.hmcts.net/providers/Microsoft.Authorization/roleAssignments/66081bd9-41df-1e76-79a4-abad68aaa0db" -> (known after apply)
      ~ name                             = "66081bd9-41df-1e76-79a4-abad68aaa0db" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/ctsc.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.darts-nle-service.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azur

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

earings.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/court-tribunal-hearings.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.platform-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/6462ef4f-c18d-ca2d-cb22-1b5e78ce5ec1" -> (known after apply)
      ~ name                             = "6462ef4f-c18d-ca2d-cb22-1b5e78ce5ec1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/platform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/platform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pre-recorded-evidence-justice.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/pre-recorded-evidence.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/e7fdf21a-5be7-be62-d12f-4e08aaa91d05" -> (known after apply)
      ~ name                             = "e7fdf21a-5be7-be62-d12f-4e08aaa91d05" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/pre-recorded-evidence.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/pre-recorded-evidence.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.probatesearch.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/probatesearch.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/0283b6d9-62fa-c0e2-4237-a5cd4540d348" -> (known after apply)
      ~ name                             = "0283b6d9-62fa-c0e2-4237-a5cd4540d348" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/probatesearch.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/probatesearch.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.prod-hmcts-net.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/prod.hmcts.net/providers/Microsoft.Authorization/roleAssignments/daa927ff-dac5-6f2f-d19c-a24e185eb3a6" -> (known after apply)
      ~ name                             = "daa927ff-dac5-6f2f-d19c-a24e185eb3a6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/prod.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/prod.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.prod-internal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/prod.internal.hmcts.net/providers/Microsoft.Authorization/roleAssignments/c1e578c0-a3c1-702c-2087-c32da2ff9d30" -> (known after apply)
      ~ name                             = "c1e578c0-a3c1-702c-2087-c32da2ff9d30" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/prod.internal.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/prod.internal.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.prod-platform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/prod.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/497548fe-1303-97b8-8203-7a91fc8ce159" -> (known after apply)
      ~ name                             = "497548fe-1303-97b8-8203-7a91fc8ce159" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/prod.platform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/prod.platform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.reform-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/reform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/c4a23fed-8f91-a350-22b0-4f6d71e099fa" -> (known after apply)
      ~ name                             = "c4a23fed-8f91-a350-22b0-4f6d71e099fa" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/reform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/reform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.reply-jury-summons.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/reply-jury-summons.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/1e73ef03-b99a-2ff3-8f3b-28873743c743" -> (known after apply)
      ~ name                             = "1e73ef03-b99a-2ff3-8f3b-28873743c743" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/reply-jury-summons.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/reply-jury-summons.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.residential-property-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/residential-property-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/1350bc2c-d3d8-948b-b435-b90b8f2c82d6" -> (known after apply)
      ~ name                             = "1350bc2c-d3d8-948b-b435-b90b8f2c82d6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/residential-property-tribunals.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/residential-property-tribunals.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.respond-divorce.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/respond-divorce.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/6051ab12-018e-0734-a9be-59584a0ddbed" -> (known after apply)
      ~ name                             = "6051ab12-018e-0734-a9be-59584a0ddbed" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/respond-divorce.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/respond-divorce.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.respond-employment-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/respond-employment-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/b2218874-5e41-a354-18ce-6b2227c8694d" -> (known after apply)
      ~ name                             = "b2218874-5e41-a354-18ce-6b2227c8694d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/respond-employment-tribunals.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/respond-employment-tribunals.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sftp-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/sftp.hmcts.net/providers/Microsoft.Authorization/roleAssignments/292c882d-5b8b-0364-bf2f-23b1c67db92e" -> (known after apply)
      ~ name                             = "292c882d-5b8b-0364-bf2f-23b1c67db92e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/sftp.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sftp.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.track-benefit-appeal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/track-benefit-appeal.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/f8ec332d-4a86-e78e-5c0d-de460a598204" -> (known after apply)
      ~ name                             = "f8ec332d-4a86-e78e-5c0d-de460a598204" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/track-benefit-appeal.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/track-benefit-appeal.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/tribunalsdecisions.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/b1d567be-72b2-88e5-639d-6edfd1930c22" -> (known after apply)
      ~ name                             = "b1d567be-72b2-88e5-639d-6edfd1930c22" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/tribunalsdecisions.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/tribunalsdecisions.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vh.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/vh.hmcts.net/providers/Microsoft.Authorization/roleAssignments/94056116-a9d0-af25-a1f7-e710ee0af61d" -> (known after apply)
      ~ name                             = "94056116-a9d0-af25-a1f7-e710ee0af61d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/vh.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/vh.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 50 to add, 0 to change, 50 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1175,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->